In [1]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [2]:
import pandas as pd
population = [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523]
df = pd.DataFrame(population)
df

         0
0   35.467
1   63.951
2   80.940
3   60.665
4  127.061
5   64.511
6  318.523

In [5]:
import pandas as pd
data = [
    [35.467, 17348075],
    [63.951, 1785387],
    [80.94, 2833687],
    [60.665, 3874437],
    [127.061, 2167744],
    [64.511, 4602367],
    [318.523, 2950039]
]
df = pd.DataFrame(data)
df

         0         1
0   35.467  17348075
1   63.951   1785387
2   80.940   2833687
3   60.665   3874437
4  127.061   2167744
5   64.511   4602367
6  318.523   2950039

In [12]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
})

df.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

print(df)

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [13]:
df.columns

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'], dtype='object')

In [14]:
df[["Population", "GDP"]]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

In [15]:
df.loc["Canada"]

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [16]:
df.iloc[0]

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [20]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, 
    columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])

print(df)

         Population      GDP  Surface Area
Canada       35.467  1785387       9984670
France       63.951  2833687        640679
Germany      80.940  3874437        357114

In [21]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])

df.loc["France"]

Population           63.951
GDP             2833687.000
Surface Area     640679.000
Name: France, dtype: float64

In [22]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])

df.loc["Canada":"Germany"]

         Population      GDP  Surface Area
Canada       35.467  1785387       9984670
France       63.951  2833687        640679
Germany      80.940  3874437        357114

In [23]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])

df.loc["Canada":"Germany", "Population":"GDP"]

         Population      GDP
Canada       35.467  1785387
France       63.951  2833687
Germany      80.940  3874437

In [31]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])

df.iloc[-1]

Population           80.94
GDP             3874437.00
Surface Area     357114.00
Name: Germany, dtype: float64

In [32]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])
df.iloc[0:2]

        Population      GDP  Surface Area
Canada      35.467  1785387       9984670
France      63.951  2833687        640679

In [33]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94],
    'GDP': [1785387, 2833687, 3874437],
    'Surface Area': [ 9984670, 640679, 357114]
}, columns=['Population', 'GDP', 'Surface Area'], index=['Canada','France','Germany'])
df.iloc[0:2, 0:2]

        Population      GDP
Canada      35.467  1785387
France      63.951  2833687

In [6]:
#assignment

import pandas as pd

data = pd.DataFrame({
    "Athlete" : ['Michael Phelps', 'Michael Phelps', 'Michael Phelps', 'Natalie Coughlin', 'Aleksey Nemov'],
    "Age" : [23,19,27,25,24],
    "Country" : ['United states', 'Canada', 'United States', 'Norway', 'China'],
    "Year" : [2008,2004,2012,2008,2000],
    "Gold Medals" : [8,6,4,1,2]
}, columns = ["Athlete","Age","Country","Year","Gold Medals"])

data

            Athlete  Age        Country  Year  Gold Medals
0    Michael Phelps   23  United states  2008            8
1    Michael Phelps   19         Canada  2004            6
2    Michael Phelps   27  United States  2012            4
3  Natalie Coughlin   25         Norway  2008            1
4     Aleksey Nemov   24          China  2000            2

In [8]:
data.iloc[0:,[0,2,3]]

            Athlete        Country  Year
0    Michael Phelps  United states  2008
1    Michael Phelps         Canada  2004
2    Michael Phelps  United States  2012
3  Natalie Coughlin         Norway  2008
4     Aleksey Nemov          China  2000

In [9]:
data.iloc[0:3,[0,2,3]]

          Athlete        Country  Year
0  Michael Phelps  United states  2008
1  Michael Phelps         Canada  2004
2  Michael Phelps  United States  2012